<details><summary>Digger run report at 2024-02-27 11:56:07 (UTC)</summary>
  <details><summary>Apply for <b>xlrdlab/quickstart-actions-aws#production</b></summary>
  
```terraform
Terraform will perform the following actions:

  # aws_s3_bucket.test will be created
  + resource "aws_s3_bucket" "test" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "alexp-test-12399"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
aws_s3_bucket.test: Creating...
aws_s3_bucket.test: Creation complete after 3s [id=alexp-test-12399]

Warning: Argument is deprecated

  with aws_s3_bucket.test,
  on main.tf line 21, in resource "aws_s3_bucket" "test":
  21:   acl    = "private"

Use the aws_s3_bucket_acl resource instead

(and 2 more similar warnings elsewhere)

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.

  ```
</details>
</details>